ArrayList (хотя бы 2 любые задачи)

Задача 1:
Создайте ArrayList из 5 чисел. Добавьте ещё одно число в конец. Выведите весь список.
Подсказка:
Используй Arrays.asList() для создания списка из 5 чисел.
Чтобы добавить ещё одно число, оберни в new ArrayList<>(...), потому что список из Arrays.asList() фиксирован по размеру.
Для добавления — метод add(), для вывода — System.out.println(list) или цикл for.

Задача 2:
Напишите программу, которая выводит все чётные числа из ArrayList.
Подсказка:
Создай ArrayList<Integer> и заполни числами.
Используй цикл for-each для прохода по списку.
Внутри цикла используй условие if (number % 2 == 0), чтобы проверить чётность.
Выводи подходящие числа с помощью System.out.println().

Задача 3:
Создайте ArrayList из строк. Найдите в нём самую длинную строку и выведите её.
Подсказка:
Объяви переменную String longest = "".
Пройдись по списку с помощью цикла for-each.
Внутри цикла сравни длину текущей строки с longest.length() и обнови longest, если найдена строка длиннее.
После цикла выведи longest.

Задача 4:
Создайте ArrayList из целых чисел. Напишите программу, которая вычисляет и выводит сумму всех чисел в списке.
Подсказка:
Объяви int sum = 0.
Используй цикл for-each для перебора всех элементов списка.
На каждой итерации прибавляй текущее число к переменной sum.
После цикла выведи sum через System.out.println().

Задача 5:
Создайте ArrayList из целых чисел. Напишите программу, которая находит и выводит максимальное число из списка.
Подсказка:
Можно использовать Collections.max(list).
Или вручную:
Объяви переменную int max = list.get(0) (предположим, что список не пуст).
Пройдись по списку в цикле.
Если текущее число больше max, обнови значение переменной.
После цикла выведи max.

HashMap (хотя бы 2 любые задачи)

Задача 1:
Создайте HashMap<String, Integer>, добавьте 5 пар (имя – возраст) и выведите все записи.
Подсказка:
Используй HashMap<String, Integer>
Добавь пары с помощью put("Имя", возраст)
Пройдись по паре Map.Entry<String, Integer> с помощью for-each цикла
Используй entry.getKey() и entry.getValue() для вывода каждой записи

Задача 2:
Проверьте, есть ли определённое имя в HashMap.
Подсказка:
Используй метод containsKey("Имя")
Имя можно задать вручную или получить через Scanner
Если имя найдено — выведи возраст или сообщение "Найдено"
Если не найдено — выведи "Не найдено"

Задача 3:
Реализуйте метод, который печатает из HashMap всех пользователей младше 18 лет.
Подсказка:
Создай метод с сигнатурой void printUnderage(Map<String, Integer> map)
Пройдись по элементам с помощью for (Map.Entry<String, Integer> entry : map.entrySet())
Внутри цикла проверь entry.getValue() < 18
Если условие выполняется — выведи имя и возраст

LinkedHashMap (хотя бы 1 любая задача)

Задача 1:
Создайте LinkedHashMap и добавьте в него 5 элементов. Выведите их в порядке добавления.
Подсказка:
Используй LinkedHashMap<String, Integer> или другой тип на выбор
Добавляй элементы методом put(key, value)
Используй цикл for (Map.Entry<K, V> entry : map.entrySet())
LinkedHashMap сохраняет порядок добавления — элементы выведутся в том же порядке, в котором были добавлены

Задача 2:
Реализуйте телефонную книгу с LinkedHashMap. Добавьте и найдите контакт.
Подсказка:
Используй LinkedHashMap<String, String> где ключ — имя, значение — номер телефона
Для добавления используй put(name, phone)
Для поиска используй containsKey(name) и get(name)
Имя можно передать в метод или считать с клавиатуры
Если контакт найден — выведи номер телефона, иначе сообщение "Контакт не найден"

Задача 3:
Создайте LinkedHashMap, который хранит историю просмотров пользователя (максимум 10 элементов).
Подсказка:
Используй LinkedHashMap<String, String> где ключ — идентификатор страницы, значение — её название
Если размер мапы 10, а добавляется новый элемент - удаляй первый.
Выводи историю с помощью entrySet(), порядок будет от самого старого к новому

TreeMap (хотя бы 1 любая задача)

Задача 1:
Создайте TreeMap и добавьте 5 ключей (имена) и значений (баллы). Выведите отсортированные данные.
Подсказка:
Используй TreeMap<String, Integer>
Добавляй пары с помощью put(name, score)
TreeMap сортирует ключи по алфавиту
Для вывода используй цикл for (Map.Entry<String, Integer> entry : map.entrySet())
Убедись, что имена добавляются в случайном порядке, чтобы увидеть сортировку по ключу

Задача 2:
Найдите минимальный и максимальный ключ в TreeMap.
Подсказка:
После создания и заполнения TreeMap, используй методы:
firstKey() — возвращает минимальный ключ
lastKey() — возвращает максимальный ключ
Выведи оба значения через System.out.println()

PriorityQueue

Задача 1:
Создайте PriorityQueue и добавьте 5 чисел. Выведите их в порядке удаления.
Подсказка:
Используй PriorityQueue<Integer>
Добавляй числа через add() или offer()
Элементы автоматически сортируются по возрастанию при извлечении
Используй poll() в цикле while (!queue.isEmpty()) для поочерёдного извлечения и вывода


ArrayDeque (хотя бы 1 любая задача)

Задача 1:
Создайте ArrayDeque, добавьте 5 элементов и выведите их.
Подсказка:
Используй ArrayDeque<String> (или другой тип по желанию)
Добавляй элементы с помощью add() или addLast()
Для вывода используй for-each цикл или System.out.println(deque)
ArrayDeque сохраняет порядок добавления при обычном использовании

Задача 2:
Используйте ArrayDeque как стек: добавьте элементы и извлеките их в обратном порядке.
Подсказка:
Добавляй элементы с помощью push()
Извлекай с помощью pop() — они будут извлекаться в порядке LIFO (последним добавлен — первым извлечён)
Используй while (!deque.isEmpty()) для последовательного извлечения и вывода

Задача 3:
Используйте ArrayDeque как очередь: добавьте элементы в начало и конец, извлеките из обоих концов.
Подсказка:
Используй addFirst() и addLast() для добавления в начало и конец
Извлекай элементы с помощью removeFirst() и removeLast()
Выводи результат после каждого извлечения, чтобы увидеть порядок
ArrayDeque отлично работает как двусторонняя очередь (deque)

LinkedList (хотя бы 2 любые задачи)

Задача 1:
Создайте LinkedList и добавьте в него 5 строк. Выведите все элементы списка.

Задача 2:
Реализуйте очередь задач с LinkedList. Добавьте 3 задачи и обработайте их в порядке поступления.

Задача 3:
Создайте LinkedList, содержащий несколько строк. Напишите программу, которая печатает первый и последний элементы списка.

Задача 4:
Создайте LinkedList из целых чисел. Напишите программу, которая вычисляет сумму элементов списка.

Задача 5:
Используйте ListIterator для прохода по LinkedList в обоих направлениях.